---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeUserSketchPlane
source: html/b6be39e3-8040-b705-fe0a-dfae3463db08.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.CannotChangeUserSketchPlane Property

Can't change plane of [Element Name] Sketch.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotChangeUserSketchPlane { get; }
```